[
    {
        "title": "Bad Movie Challenge",
        "description":[
            "This was a collaborative project with 4 other developers. Users can register/login and search a database of movies to challenge themselves or their friends to watch. Lists of users watched movies and challenges are stored in an SQL database."
        ],
        "deployed_link": "http://project22sample.herokuapp.com/",
        "github_link":"https://github.com/detanracnier/The_Bad_Movie_Challenge"
    },
    {
        "title": "Hex Map Pathfinding",
        "description":[
            "This was a challenge to myself to create a scalable hex map that could then utilize pathfinding algorithms to connect a start and end point. Users can draw walls and watch in real time as the algorithm solves for the most efficient path.",
            "This project practiced pathfinding algorithms as well as some trigonomitry to create the hex shapes for the map."
        ],
        "deployed_link": "https://detanracnier.github.io/hex_map_pathfinding/",
        "github_link":"https://github.com/detanracnier/hex_map_pathfinding"
    },
    {
        "title": "Weather Dashboard API",
        "description":[
            "This weather dashboard uses openweathers api to display location forcast data. Users last searches are saved locally so they can quickly view the forecast for their previous searches.",
            "This honed my mastery of bootstrap, local storage, as well as consuming 3rd party API documentation."
        ],
        "deployed_link": "https://detanracnier.github.io/BC_11-7_Weather_Dashboard/",
        "github_link":"https://github.com/detanracnier/BC_11-7_Weather_Dashboard"
    },
    {
        "title": "Shadowrun Fixer",
        "description":[
            "This app was created to assist players in managing combat in the table-top system Shadowrun 3.0. Users are walked through the steps of a combat round; entering in all relevant values from easy to use tables and dropdown lists.",
            "This project was my introduction to React as well as Redux."
        ],
        "deployed_link": "http://spencerrosio.net/",
        "github_link":"https://github.com/detanracnier/shadow_run_fixer"
    },
    {
        "title": "Bigs Burgers",
        "description":[
            "This app allows users to enter burgers which are stored in a SQL database. Users can interact with the database by 'consuming' the burgers and having the view update with the new DB state.",
            "This app was created using express, mysql, and handlebars to demonstrate MVC and ORM patterns."
        ],
        "deployed_link": "https://fast-harbor-74588.herokuapp.com/",
        "github_link":"https://github.com/detanracnier/burger"
    }
]